asanza/pulsegen/src/arch/stm32f107/sys.c
#include <stm32f1xx.h>
#include <stm32f1xx_ll_rcc.h>
#include <stm32f1xx_ll_system.h>
#include <stm32f1xx_ll_cortex.h>
#include <stm32f1xx_ll_utils.h>
#include <hal/sys.h>
#include <stdint.h>

static void SystemClock_Config(void)
{

  LL_FLASH_SetLatency(LL_FLASH_LATENCY_2);

  if(LL_FLASH_GetLatency() != LL_FLASH_LATENCY_2)
  {
    asm("bkpt");
  }
  LL_RCC_HSE_Enable();

   /* Wait till HSE is ready */
  while(LL_RCC_HSE_IsReady() != 1)
  {
    
  }
  LL_RCC_PLL_ConfigDomain_SYS(LL_RCC_PLLSOURCE_HSE_DIV_2, LL_RCC_PLL_MUL_6);

  LL_RCC_PLL_Enable();

   /* Wait till PLL is ready */
  while(LL_RCC_PLL_IsReady() != 1)
  {
    
  }
  LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);

  LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_2);

  LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_1);

  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL);

   /* Wait till System clock is ready */
  while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL)
  {
  
  }
  LL_Init1msTick(72000000);

  LL_SYSTICK_SetClkSource(LL_SYSTICK_CLKSOURCE_HCLK);

  LL_SetSystemCoreClock(72000000);

  /* SysTick_IRQn interrupt configuration */
  NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
}

void _init( void )
{
  SystemClock_Config();
}

bool hal_sys_is_irq( void )
{
	uint32_t result;
  asm volatile ("MRS %0, ipsr" : "=r" (result) );
	return(result != 0);
}

bool hal_sys_lock(hal_mutex_t *lock)
{
  if (__LDREXB((unsigned char volatile *)lock) != 0) {
    return false;
  }
  if (__STREXB(1, (unsigned char volatile *)lock) != 0) {
    return false;
  }
  __DMB();
  return true;
}

void hal_sys_unlock(hal_mutex_t *lock)
{
  __DMB();
  *lock = 0;
}